// pages/news/news.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    news: [{ title: "hotwind热风加盟条件有哪些？热风加盟费多少？", comefrom: "服装网", readcount: "12", date: "2018-5-7", desc: "hotwind热风1996年在上海创立，一直非常关注时尚焦点，针对年轻人的敏锐活力，不断推陈出新，倡导流行，兼顾时尚性和实用性，充分满足个性化的审美观，通过不断成长，成为都市时尚中" }, { title: "迪卡侬加盟电话多少？经营模式怎样？", comefrom: "服装网2", readcount: "15", date: "2018-5-7", desc: "迪卡侬是来自法国的品牌，是全球规模最大的体育零售品牌。从2003年至今，已经在全国46座城市开设了100多家商场，是我国许多运动爱好者首选的购物商场。许多投资者都想了解迪卡侬加盟电话以及其经营模式，针对这些疑问我们一起来看下文。" }, { title: "袜子加工厂加盟成本多少钱", comefrom: "服装网", readcount: "12", date: "2018-5-7", desc: "相信每一个人的生活中都缺少不了的一个样东西就是袜子，袜子在生活中的销量还是比较高的，有一些想要创业的人就想要开一个袜子加工厂" }, { title: "百衣百顺服装加盟的条件有哪些？百衣百顺服装怎么", comefrom: "服装网", readcount: "12", date: "2018-5-7", desc: "百衣百顺是去年海澜集团隆重推出的全新服装品牌，以超大规模的男性服装专卖形式，一站式购物的营销方式，加上独特的门店设计，轻松的选购环境，齐全的系列产品来打造自己的核心竞争力" }, { title: "旧衣服回收公司加盟怎么样", comefrom: "服装网", readcount: "12", date: "2018-5-7", desc: "现在可以发现我们的社会是一个非常环保的社会，我们可以看到一个现象就是很多旧的东西都会回收利用包括旧衣服，有一些人就抓住了这一次商机，想要加盟旧衣服回收公司里面去，但是毕竟是做生意，所以他们肯定要考虑旧衣服回收公司加盟怎么样这个问题的答案" }]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})